{
  "model_type": "barbet",
  "architectures": ["BarbetForCausalLM"],
  "auto_map": {
    "AutoConfig": "configuration_barbet.BarbetConfig",
    "AutoModel": "modeling_barbet.BarbetModel",
    "AutoModelForCausalLM": "modeling_barbet.BarbetForCausalLM"
  },
  "vocab_size": 114822,
  "hidden_size": 1024,
  "intermediate_size": 2816,
  "num_hidden_layers": 12,
  "num_attention_heads": 8,
  "num_key_value_heads": 2,
  "head_dim": 128,
  "max_position_embeddings": 262144,
  "rope_theta": 10000000.0,
  "sliding_window_size": 8192,
  "global_attention_layers": [0, 4, 8],
  "mamba_layers": [3, 7, 11],
  "qk_norm": true,
  "qk_logit_clip": false,
  "qk_clip_threshold": 100.0,
  "attention_sink": false,
  "rms_norm_eps": 1e-6,
  "hidden_dropout": 0.0,
  "attention_dropout": 0.0,
  "initializer_range": 0.02,
  "use_cache": true,
  "tie_word_embeddings": false,
  "mamba_d_state": 64,
  "mamba_d_conv": 4,
  "mamba_expand": 2,
  "mtp_enabled": true,
  "mtp_offsets": [2, 3],
  "mtp_loss_weights": {"2": 0.2, "3": 0.1},
  "pad_token_id": 3,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "unk_token_id": 0,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.0"
}
