{
  "model_type": "barbet",
  "architectures": ["BarbetForCausalLM"],
  "auto_map": {
    "AutoConfig": "configuration_barbet.BarbetConfig",
    "AutoModel": "modeling_barbet.BarbetModel",
    "AutoModelForCausalLM": "modeling_barbet.BarbetForCausalLM"
  },
  "vocab_size": 114944,
  "hidden_size": 1536,
  "intermediate_size": 5120,
  "num_hidden_layers": 28,
  "num_attention_heads": 16,
  "num_key_value_heads": 2,
  "head_dim": 128,
  "max_position_embeddings": 262144,
  "rope_theta": 10000000.0,
  "sliding_window_size": 8192,
  "global_attention_layers": [0, 4, 8, 12, 16, 20, 24],
  "mamba_layers": [3, 7, 11, 15, 19, 23, 27],
  "qk_norm": true,
  "qk_logit_clip": false,
  "qk_clip_alpha": 0.5,
  "qk_clip_threshold": 100.0,
  "attention_sink": false,
  "rms_norm_eps": 1e-6,
  "hidden_dropout": 0.0,
  "attention_dropout": 0.0,
  "initializer_range": 0.02,
  "use_cache": true,
  "tie_word_embeddings": true,
  "mamba_d_state": 64,
  "mamba_d_conv": 4,
  "mamba_expand": 2,
  "mtp_enabled": true,
  "mtp_offsets": [2, 3],
  "mtp_loss_weights": {"2": 0.2, "3": 0.1},
  "pad_token_id": 114691,
  "bos_token_id": 114689,
  "eos_token_id": 114690,
  "unk_token_id": 114688,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.0"
}
